# AddTemperatureRatingType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialType..::..AddTemperatureRatingType Method
WireMaterialType Class See Also
---
Add a new temperature rating type into material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TemperatureRatingType AddTemperatureRatingType(
	string name,
	TemperatureRatingType baseOn
)
```

Visual Basic
---
```text
Public Function AddTemperatureRatingType ( _
	name As String, _
	baseOn As TemperatureRatingType _
) As TemperatureRatingType
```

Visual C++
---
```text
public:
TemperatureRatingType^ AddTemperatureRatingType(
	String^ name,
	TemperatureRatingType^ baseOn
)
```

# ### Parameters
name
    Type: System..::..StringName of temperature type to be added.
baseOn
    Type: Autodesk.Revit.DB.Electrical..::..TemperatureRatingTypeThe new temperature rating will be created base on this existing temperature rating type.
# ### Return Value
New constructed temperature rating type.
# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace